#!/usr/bin/python3
# -*- coding: utf-8 -*-

import cv2
import numpy as np
import xxhash
from PIL import Image

SCREEN = (1280, 720)
POS_IDLE = (1062, 678)
SUB_MENU = (1200, 106, 1260, 140, 100)
SUB_RESOURCE = (748, 240, 880, 260, -130)
SUB_REGION = (1120, 222, 1260, 244, 90)
SUB_DAYLIGHT = (1188, 270, 1220, 284, 100)
SUB_VIEW = (90, 90, 1070, 600, 0)
SUB_DAN_FAN = (922, 205, 1007, 238, 140)
SUB_DAN_HOT = (428, 520, 796, 528, 120)
SUB_TRAVEL_TICKET = (315, 572, 442, 600, -80)
SUB_STAMINA = (168, 14, 208, 34, 160)
SUB_CANCEL = (356, 446, 446, 476, -110)
SUB_PLANT = (310, 180, 386, 208, -130)
SUB_PLANTING = (726, 380, 752, 400, 40)
SUB_WUDAO = (896, 524, 1006, 550, -80)


def SUB_NEAR(idx):
    idx *= 54
    return (1166, 325+idx, 1234, 353+idx, -80)


def SUB_ACTION(idx):
    idx *= 73
    return (746, 295+idx, 818, 325+idx, 180)


def SUB_SPOT(x, y):
    dx = (x-y) * 72
    dy = (x+y) * 36
    return (522+dx, 337+dy, 592+dx, 371+dy)


STUCK = {
    '洛阳(3,31)': (9, 32),
    '南阳渡(13,9)': (19, 10),
    '南阳渡(18,15)': (26, 15),
    '杭州(22,15)': (21, 10),
    '杭州(21,10)': (17, 6),
    '华山(0,25)': (10, 28),
    '落霞镇(10,28)': (17, 30),
    '太乙山(28,29)': (25, 33),
}

MAP = {
    '塞北': (801, 3),
    '幽州': (1077, 119),
    '泰安镇': (1102, 267),
    '姑苏': (1136, 403),
    '杭州': (1100, 513),
    '泉州': (1153, 574),
    '龙泉镇': (998, 556),
    '嵩山': (859, 240),
    '洛阳': (872, 334),
    '南阳渡': (825, 447),
    '双王镇': (824, 516),
    '南岭': (783, 704),
    '落霞镇': (714, 287),
    '太乙山': (718, 402),
    '凤鸣集': (678, 511),
    '明月山': (687, 588),
    '鄯善': (457, 99),
    '敦煌': (346, 157),
    '成都': (546, 563),
    '峨眉山': (412, 647),
    '大雪山': (240, 366),
    '十方集': (134, 47),
}

WALK_MAP = {
    '祁连山': ('华山', (16, 0)),
    '华山': ('敦煌', (29, 26)),
    '青城山': ('大雪山', (32, 30)),
    '天山': ('十方集', (0, -2)),
}

INNER_MAP = {
    '雷峰塔': (4, 8),
}


SHORTRSC = [
    '杭州(10,18)',
    '杭州(14,32)',
    '峨眉山(43,5)',
    '洛阳(3,6)',
    '洛阳(34,27)',
    '南阳渡(14,6)',
    '落霞镇(29,35)',
    '落霞镇(32,22)',
    '姑苏(32,23)',
    '龙泉镇(11,19)',
    '双王镇(22,27)',
    '凤鸣集(5,2)',
    '成都(30,2)',
    '泉州(20,2)',
    '泉州(17,1)',
    '峨眉山(37,20)',
    '峨眉山(43,5)',
    '成都(25,5)',
    '南岭(1,17)',
    '天山(18,20)',
]

RESOURCE = {
    '幽州': [(33, 36), (23, 31), (25, 32), (8, 20)],
    '洛阳': [(11, 42), (25, 2), (21, 37), (2, 34), (3, 6), (20, 30), (34, 27)],
    '落霞镇': [(19, 31), (26, 4), (41, 32), (9, 28), (29, 35), (32, 22), (18, 12)],
    '南阳渡': [(44, 24), (22, 4), (8, 14), (13, 30), (14, 6), (19, 19)],
    '太乙山': [(26, 30), (2, 16)],
    '嵩山': [(8, 35), ],
    '泰安镇': [(33, 9), (20, 38), (7, 4), (19, 21), (33, 23)],
    '姑苏': [(28, 2), (4, 22), (10, 26), (32, 23), (20, 20)],
    '杭州': [(30, 2), (30, 26), (20, 5), (14, 32)], # , (10, 18)
    '龙泉镇': [(3, 2), (19, 5), (24, 17), (3, 17), (11, 19)],
    '泉州': [(15, 28), (17, 1), (20, 2)],
    '南岭': [(12, 10), (12, 21), (27, 18), (18, 4), (1, 17)],
    '双王镇': [(23, 13), (19, 32), (3, 23), (28, 16), (22, 27), (21, 23)],
    '凤鸣集': [(2, 25), (22, 17), (28, 31), (26, 20), (5, 2), (15, 21)],
    '明月山': [(35, 18), (10, 23)],
    '成都': [(30, 2), (25, 5), (31, 8)],
    '峨眉山': [(19, 1), (46, 27), (37, 20), (43, 5)],
    '大雪山': [(4, 21), ],
    '十方集': [(8, 19), ],
    '天山': [(18, 20), ],
}

ORDER = {
    #'茯苓': {'凤鸣集(12,23)': '5d', '杭州(24,17)': '2d', '幽州(16,28)': '5c'},
    # '白芍': {'南阳渡(25,23)': '5c', '幽州(16,28)': '2e'},
    '金银花': {'南阳渡(25,23)': '3d', '成都(16,14)': '5d'},
    '当归': {'洛阳(17,27)': '5d'},
    #'杜仲': {'洛阳(17,27)': '5e', '凤鸣集(12,23)': '2e'},
    '雄黄': {'洛阳(17,27)': '2f', '姑苏(21,16)': '3e'},
    '牛黄': {'杭州(24,17)': '2f'},
    '黄精': {'幽州(16,28)': '2f', '姑苏(21,16)': '5c'},

    '解毒丹': {'落霞镇(24,28)': '1b', '成都(16,14)': '1a'},
    '金疮药': {'姑苏(21,16)': '2a', '幽州(16,28)': '3b', '杭州(24,17)': '3b', '太乙山(20,15)': '2d'},

    '竹叶青': {'峨眉山(41,27)': '3c'},
    '剑南烧春': {'成都(18,8)': '2b'},
    '西凤酒': {'祁连山(6,20)': '1a'},

    '佛香': {'太乙山(20,15)': '1a', '嵩山(13,14)': '1a'},

    '苹果': {'杭州(27,23)': '5a'},
    '香蕉': {'杭州(27,23)': '5b'},
    '西瓜': {'杭州(27,23)': '5c'},
    '山楂': {'杭州(27,23)': '5d'},

    '调料': {'洛阳(24,29)': '5a'},
    '葱蒜': {'洛阳(24,29)': '5b'},
    '辣椒': {'洛阳(24,29)': '5c'},
    '米': {'洛阳(24,29)': '5d'},
    '青菜种子': {'洛阳(24,29)': '3e'},
    '韭菜种子': {'洛阳(24,29)': '3f'},
    '冬瓜种子': {'洛阳(24,29)': '3g'},
    '茄子种子': {'洛阳(24,29)': '3h'},

    '豆腐': {'幽州(7,22)': '5d', '杭州(32,21)': '5d'},

    '红糖': {'青城山(11,6)': '5a'},
    '蜂蜜': {'青城山(11,6)': '2b'},
    '桂花蜜': {'青城山(11,6)': '3c'},

    '鱼竿': {'南阳渡(24,20)': '1g', '凤鸣集(13,25)': '1g', '泉州(13,15)': '1g'},
    '鱼饵': {'南阳渡(24,20)': '1h', '凤鸣集(13,25)': '1h', '姑苏(15,16)': '1h', '泉州(13,15)': '1h'},
    '白炼石': {'南阳渡(25,25)': '10f', '洛阳(15,21)': '20f', '姑苏(15,21)': '30f', '龙泉镇(22,4)': '40f'},
    '绿炼石': {'幽州(16,31)': '10k', '泉州(17,20)': '10k'},
    '蓝炼石': {'十方集(16,10)': '10j'},
    '紫金': {'十方集(16,10)': '5i'},
}


OCR = {
    # resource name
    '4f452434fb940602+4f927ef19138052d': '剩',
    '4f452434fb940602+f74e2c90f09bd225': '剩',
    '81c5b1b7fe4e41b5': '余',
    '6d5bd4b09bcbc985': '资',
    '09c8a5b1bc555ef1+11818dc3d642321e': '源',

    # resource count
    'f462f1593319a196': '0',
    '82e568becd2bb02f': '0',
    '2524d69646e769a3': '1',
    '60c1a6457443df26': '1',
    '5719ddc17465ebe7': '2',
    'cc2bcb06eda2efd7': '2',
    '9de390d82e99bd06': '3',
    'ae2cddd9da7bb199': '3',
    'a66e9ce8ebff06a1': '4',
    '877ea24a6130c98e': '4',
    'b6b13dc2cd03564c': '5',
    '83690aafe0050be4': '5',
    'a7514792fc9848cd': '6',
    'b0af644229ed0e59': '6',
    '185eb70e32ef7de1': '7',
    '75d2ad45829e20b4': '7',
    '8ecb07c3b33133bb': '8',
    '183542bceeaabf81': '8',
    'c890677c509c8fc6': '9',
    '545ac9a1eeac3696': '9',

    # stamina
    '0ad15eb3d6b6ab07': '0',
    '2dd043a735d91231': '0',
    '8dee69b4f9d0bbb9': '0',
    '2213b2064762ce54': '0',
    '359953365dbaf0ff': '0',
    '165a5ca11dbebc61': '1',
    '373075f83497b59f': '1',
    'a259994df767edd9': '1',
    '63e22419d7ed3796': '1',
    '418156c601a80811': '1',
    '9c3b858a521be1a9': '1',
    '12e9dec649ccbd2b': '1',
    '686efacfc7605472': '2',
    '1f80cb719ced47da': '2',
    '06cbc42efceeea01': '2',
    '940b47a0d1d877cb': '2',
    '9de60a52201ab2cc': '2',
    '6ba2df48c7027924': '2',
    '6732d4370629a1b3': '2',
    '2a78c5ce39ab6267': '2',
    '7e8002548051f46f': '2',
    '08806595b84ab360': '3',
    '9a42026f2dedcdd2': '3',
    'ff7dfb70c7c5a388': '3',
    '83c3403135fc10d9': '3',
    'b62d95225766b2d6': '3',
    '390cf8a3f1cda5bd': '3',
    '7ec927b07d3a8416': '3',
    '41155b64ca91d246': '4',
    '27e66557192523dd': '4',
    '5bc6eb950763e675': '4',
    'ba2ead8680197914': '4',
    '1a6467f054d186b7': '4',
    '1d25f74e4c182b80': '5',
    'a4859a29b311a8b7': '5',
    '5cc697948fa3eb05': '5',
    '24ad474f828841df': '5',
    'f97de52b56992ae5': '6',
    '34e6db6b02d244b3': '6',
    'a7548b851bbd8997': '6',
    '533d7922b62a5af6': '6',
    '7b462f13ab128c3f': '6',
    'fad293e740e32e12': '6',
    '9971855278abc9e1': '6',
    '85fc80dbb2d025b2': '6',
    '9488c8679d6a7162': '7',
    '2fd5ed41bb42d3da': '7',
    'af816a076664547d': '7',
    '86fb70a902f5d52c': '8',
    'ca37f3e236337518': '8',
    '294d342f8d725d85': '8',
    'a710630e35dff112': '8',
    'd8dde5532e0b554f': '8',
    'c7971a3784293a99': '8',
    '7311ae6e0dc1d70a': '9',
    '8606f3c87ce0803e': '9',
    '0fb0cca4f8751070': '9',
    'af591f9da4e8a363': '9',
    '16a321a6a78a959c': '9',
    '68433756f863b390': '',
    '33cc7223159e9ce6': '',

    # region
    'e8fcdae9bab13e96': ',',
    'e4602bfd2a62ae40': ',',
    'f3b8189fc293f86c': ',',
    '2f26cd485f8fcb3c': ',',

    '256111942d6fd8ef': '南',
    '3fefa622f565b7ed': '南',
    'fcfe5d6b6a6476ee': '南',
    '4616bea736ef4435': '南',
    '74f06906bfdb5f14': '南',
    '8ffa6e964fd56f79': '南',
    'd55664c00c22c37a': '阳',
    'b77c51109ed8d0fb': '阳',
    '2a8952bace0a34d4': '渡',
    '99144f7ec761222b': '渡',
    '17350dfd66ce0c14': '渡',

    '83831c5facd7dcda': '洛',
    '9a424480aed02075': '洛',
    '3514d31d2953cfb2': '洛',
    'c2007bb7829bdcb8': '阳',

    '0b9f31ff83042964': '落',
    '22432de24bcc2554': '落',
    '668456105b309b62': '落',
    '8ff613b03b1b9933': '落',
    'deb1d5d769606eeb': '霞',
    '8b85184e038789f0': '镇',
    'd34b9c4c3587d65e': '镇',

    '9040f809fbac4cfa': '嵩',
    'a549ad7354a768a6': '嵩',
    'a414452943a01a2f': '嵩',
    'f6b0cbc0519c34aa': '山',
    '7dbdb6253007f2c4': '山',
    '50368b444559277d': '山',
    '403f45cc309ac38a': '山',

    '58b187b41e9b2352': '泰',
    '4cc6b4ed346833a2': '安',
    'a02381efa2a71b86': '安',

    '77d87b0d33513640': '姑',
    'ebf79bf24797d98c': '姑',
    '9ad75899da29b51c': '苏',
    '5ad86e31ee004bb7': '苏',
    'bc8613247a730a0f': '苏',
    '664b83d6121897dd': '苏',
    '2b93ca4fa9bad663': '苏',

    '690239034e0dd45a+cc20393deffc087d': '杭',
    '404346f0e5589973+7e819e20cd145dda': '州',
    'eba87436c9429686+7e819e20cd145dda': '州',

    '18725d32a307c7f2': '泉',
    'b855876fe9b81333': '泉',
    'df5c8fdb9854a7ca': '泉',
    '8591afd45e220e9c': '泉',

    '622d108f44a9d1f6': '龙',

    'd14805e7015a308b': '双',
    'fb59964957e0b347': '双',
    '16911febb4c9f435': '双',
    '0289a7aa91581f6c': '王',
    '5b4d33488cd563bb': '王',

    '27601872580365ae': '明',
    '0b926ce841cf31bd': '明',
    'd9c2abdafa061b65': '月',

    '12022ddd60f0c30b': '凤',
    'ed81da1a3430bf3a': '鸣',
    '68fbddc79fc92aeb': '鸣',
    'b0cdfa647ed6e8b2': '鸣',
    'edeb568c6f7258eb': '集',
    'b6351486b9844d28': '集',
    '639e61cd8f22e660': '集',
    '167e595525f7b8d5': '集',

    '0c4dfacdf6f122c4': '峨',
    '21b0259fe705b6d4': '眉',
    '32c0067283ff1616': '眉',

    'e1060aace5436866': '成',
    'a3f7077cae4364d5': '都',
    'acbf29de43e8b82b': '都',

    '718c5db40c779513': '大',
    'ca520ef26bead8fc': '雪',

    '7e3b2fc20a682762': '敦',
    'bc7e83c53e6643ec': '煌',
    '7301e315cb66ae88': '煌',

    '50ab9eb3d40fc221': '青',
    '1dc603fa4eed374a': '青',
    '44a2cd22a2a953c9': '城',
    'fa2b2b3e93f5581e': '城',

    '23c9f5eef170a6bb': '十',
    '5d97d8b5dfaf59fb': '十',
    '472b809ddceac96f': '方',

    'e7c1b2ed343d0306': '天',

    'bc73c34e2b3cf218': '塞',
    '986ff01f0188a04c+12c2aae3185fbf71': '北',

    '1e55f8150c172afa': '幽',
    'd01229fd959a9f95': '幽',

    'efc6b2e614123b65': '太',
    'e627a9e52647dac4': '乙',

    '846896536d94cb5b': '岭',
    'fbf94167b9591c39': '岭',

    'e40ee206a4212f16': '衡',

    '0813b390a976e193': '华',
    '9f6730b18e902008': '华',

    '8a41c35d654e7d34': '祁',
    'e1e3daaebab57a3b': '连',

    '929cde53904d0acc': '雷',
    '780f0c1e62134df9': '峰',
    'e68655bf634bcd50': '塔',

    'ac1960d9966ae786': '(',
    '5f7faf401550c6d7': '(',
    'aef091470480dd28': '(',
    '8d41c1f194c66268': '(',

    'cc067b6a4b6c6a6e': ')',
    'c64fae619605a0ff': ')',
    '5d85b5cb0407fbf1': ')',
    'aab1c894a0e5f8e6': ')',

    '6390fccc3ff07b51': '0',
    '42a9165789c857cb': '0',
    '35119afa0cb8c749': '0',
    'dfc7538097bf4a04': '0',
    'ead195b361f2e0d7': '0',
    '8eef1f4a86d41f47': '0',
    '1d9406ba543df357': '0',
    '4249d32d931dbc92': '0',
    '828529a344a72037': '0',

    '95ab14ce4e3f76b9': '1',
    'e4c16b2f9f338a0f': '1',
    'ac25d35e836519c2': '1',
    '558cf069059c22f1': '1',
    '655a3102e77d8304': '1',
    'a7a104c8728d998d': '1',
    '76154be712afcac2': '1',
    'aa6cf92e840cceb9': '1',
    '737ec3a1baa47df6': '1',
    '1346f5be3b817e72': '1',

    '57fb0b7b6faa7ff4': '2',
    '3990079e16e065bc': '2',
    '7d459c9943476693': '2',
    '44a24cd3ecb8443f': '2',
    '32605c8fa1f1ff06': '2',
    '954a3810b19df2d8': '2',
    'd5cb7078c5bdb04c': '2',
    'fa8e07360ac2fb50': '2',
    '0fded74140ef8611': '2',
    '3da52b2229b5eb6e': '2',
    '7a5670a721248049': '2',

    '871c80ca7f8f4993': '3',
    'd155a081965ed746': '3',
    'e457759a3b5ccda3': '3',
    '04dbb9cac4976654': '3',
    '3c0b5d69eddf814a': '3',
    '8d59ec5d043919cc': '3',
    '34b2e45b93e92b89': '3',
    '5ef7d479e43c7859': '3',
    '26255815b17e74b9': '3',
    'b654a566570d7d26': '3',
    '66d5ec9446dd7a7b': '3',
    '0697be65a242d1c5': '3',
    '7d39dae7b6934f8a': '3',
    'b4ff5cb1221e90fd': '3',
    '5201acaaeafece9f': '3',

    'e0f24f4a0182b1a8': '4',
    '08affe60d13ce2ce': '4',
    '3822864ed894058e': '4',
    '2152a8f1b96d36b1': '4',
    '3abbc62ea8b70ca8': '4',
    '79090b8cb3f44dfe': '4',
    'bdc89fc228e89456': '4',
    'b7119ab8588b9e33': '4',
    '79f603dfd025b210': '4',
    '3a68f87985e5e7e5': '4',
    '0c1f8c737070c87c': '4',
    'ce86eac67dcda445': '4',

    'e206d3f455992d19': '5',
    '0f71c0d318a37ce6': '5',
    'e14b49f0c7fabf0e': '5',
    'c771d61874d0929b': '5',
    '011242db289ea3c0': '5',
    '0b93633726848a97': '5',
    '16e12c3ca3e3571a': '5',
    '8940d87a87e201f7': '5',
    'bdc0b379249c8f28': '5',
    '58c2ac43a85c4f11': '5',

    '52a1c00251bc8606': '6',
    'abdef9b0805e6beb': '6',
    '8335b647053b54b3': '6',
    '438c16435a18b51c': '6',
    'd2acee785b20a2eb': '6',
    'fd43f0ae202833c4': '6',
    '2bcb8e252794933f': '6',

    '68e634c9077466a4': '7',
    'ff3d6b893863ee62': '7',
    '278f041a34b267b2': '7',
    'ce563f89dcf3f9a1': '7',
    '9982f1db0477c6c0': '7',
    '0b444364d7cc9bab': '7',

    '1d198d402217f801': '8',
    '5ab3c4ea87a726fb': '8',
    '3304a981ecd56286': '8',
    '3520cc7dab7ac456': '8',
    '94ca4975a26d4f5e': '8',
    'ab12d39f2a6c868c': '8',
    'c472e36a36c1c631': '8',
    '75e84ac6dba83afd': '8',

    '1850827f57a669c7': '9',
    '913a9da89a839ca9': '9',
    '3730e72873ba47db': '9',
    '96722d834a3bc480': '9',
    '6c3cccce761517f0': '9',
    '8d0413b858237256': '9',
    '8f20be8ef7450e20': '9',
    '7db10043e64df108': '9',
    '292995a5a8723220': '9',
    '6caaeb407371448c': '9',
    'e6ae1368e6a0da0d': '9',
    'ad98b33e916c1eae': '9',
    '90d7bfbb036f7105': '9',
    '4ae477da9b5a8f16': '9',
}


def hash(arr):
    return xxhash.xxh64(arr).hexdigest()


def subimg(img: Image.Image, sub: tuple[int], show=False):
    img = np.array(img.crop(sub[:4]))
    img = cv2.cvtColor(img, cv2.COLOR_RGB2GRAY)
    if sub[4] > 0:
        _, img = cv2.threshold(img, sub[4], 255, cv2.THRESH_BINARY)
    if sub[4] < 0:
        _, img = cv2.threshold(img, -sub[4], 255, cv2.THRESH_BINARY_INV)
    if show:
        Image.fromarray(img).show(f'subimg {sub}')
    return img


def subhash(img: Image.Image, sub: tuple[int], show=False):
    return hash(subimg(img, sub, show))


def img2str(image: Image.Image, sub: tuple[int]):
    img = subimg(image, sub)
    contours, _ = cv2.findContours(
        img, cv2.RETR_EXTERNAL, cv2.CHAIN_APPROX_SIMPLE)
    hashes = []
    for i, contour in enumerate(contours):
        x, y, w, h = cv2.boundingRect(contour)
        im = img[y:y+h, x:x+w].tobytes()
        hh = hash(im)
        if h > 8 or hh in OCR:
            hashes.append((x, w, h, hh))
        # else:
        #    print(x, w, h, hh)
    hashes.sort()

    txt = ''
    i = 0
    while i < len(hashes):
        if i < len(hashes)-1:
            key = hashes[i][3] + '+' + hashes[i+1][3]
            if key in OCR:
                txt += OCR[key]
                i += 2
                continue
        key = hashes[i][3]
        i += 1
        if key in OCR:
            txt += OCR[key]
            continue
        txt += f'#{hashes[i-1]}#'

    if '#(' in txt:
        Image.fromarray(img).save('_img2str.png')

    return txt


def ismenu(image: Image.Image):
    return subhash(image, SUB_MENU) in ('cda53360832f530e', )


def bright(image: Image.Image, sub: tuple[int] = SUB_DAYLIGHT):
    return subimg(image, sub).mean()


def gridlines(img: cv2.Mat, dx: int, tcmin: int):
    sx = 455
    sy = 75
    thresh = 1.03
    lines = []
    ts = []
    while sy < 275:
        t = 0
        ct = 1
        x, y = sx, sy
        for i in range(200):
            a, b, c = img[y-1, x-dx], img[y, x], img[y+1, x+dx]
            if b > 1 and a/b > thresh and c/b > thresh:
                t += ct
                ct += 1
            elif ct > 1:
                ct -= 1
            x -= dx
            y += 1
        sx += dx
        sy += 1
        if t > tcmin:
            lines.append((sx, sy, x, y))
        ts.append(t)
    print(ts)
    return lines


def grid(image: Image.Image):
    img = subimg(image, SUB_VIEW)
    Image.fromarray(img).save('_grid.png')

    cimg = cv2.cvtColor(img, cv2.COLOR_GRAY2BGR)

    for line in gridlines(img, 2, 110):
        x1, y1, x2, y2 = line
        cv2.line(cimg, (x1, y1), (x2, y2), (255, 0, 0), 1)
    for line in gridlines(img, -2, 110):
        x1, y1, x2, y2 = line
        cv2.line(cimg, (x1, y1), (x2, y2), (0, 255, 0), 1)

    Image.fromarray(cimg).show(f'lines')
